## Series Object in Pandas

In [9]:
import pandas as pd

In [5]:
#series object in Pandas
s1 = pd.Series([1,3,4,6,7,9])

print(s1)

#checking type of s1
type(s1)

0    1
1    3
2    4
3    6
4    7
5    9
dtype: int64

pandas.core.series.Series

In [6]:
#series object with index
s2 = pd.Series([11,15,13,18,12,19],index = ['ina','mina','tina','lama','kama','rama'])

print(s2)

ina     11
mina    15
tina    13
lama    18
kama    12
rama    19
dtype: int64

In [7]:
#series object from a dictionary
s3=pd.Series({'a':10,'b':20,'c':30,'d':40})

print(s3)

a    10
b    20
c    30
d    40
dtype: int64

In [8]:
#change the index position in last series object
s4 = pd.Series({'a':10,'b':20,'c':30,'d':40},index = ['b','d','e','a','c'])

print(s4)

b    20.0
d    40.0
e     NaN
a    10.0
c    30.0
dtype: float64

## Extracting individual elements from Series Object

In [16]:
s5 = pd.Series([10,40,30,20,50,90,70])

In [17]:
#extracting a single element

print(s5[4])

50

In [18]:
#extracting elements from back

print(s5[-3:])

4    50
5    90
6    70
dtype: int64

In [23]:
#extracting a sequence of elements 

print(s5[:3])

print(s5[3:])

0    10
1    40
2    30
dtype: int64
3    20
4    50
5    90
6    70
dtype: int64

## Basic Math operation on Pandas Series

In [26]:
s6 = pd.Series([12,15,16,18,13,29])
s7 = pd.Series([41,61,77,83,26,90])

In [29]:
#adding an element
print(s6+1)

0    13
1    16
2    17
3    19
4    14
5    30
dtype: int64

In [30]:
#adding two series
print(s6+s7)

0     53
1     76
2     93
3    101
4     39
5    119
dtype: int64

In [31]:
#multiplying a series with scaler
print(s6*10)

0    120
1    150
2    160
3    180
4    130
5    290
dtype: int64

In [32]:
#dividing a series with scaler
print(s6/2)

0     6.0
1     7.5
2     8.0
3     9.0
4     6.5
5    14.5
dtype: float64

## Pandas Dataframe

In [39]:
data = pd.DataFrame({"Name" : ['Abir','Sayan','Kartik','Virat','Gobor'],
                     "Marks" : [79,67,81,92,50],
                     "Remark" : ['gd','ok','gd','wow','ok']})

In [40]:
data

     Name  Marks Remark
0    Abir     79     gd
1   Sayan     67     ok
2  Kartik     81     gd
3   Virat     92    wow
4   Gobor     50     ok

In [46]:
iris = pd.read_csv('iris.csv')

In [47]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [48]:
iris.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [49]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [50]:
iris.shape

(150, 5)

In [51]:
iris.min()

Sepal.Length       4.3
Sepal.Width          2
Petal.Length         1
Petal.Width        0.1
Species         setosa
dtype: object

In [52]:
iris.max()

Sepal.Length          7.9
Sepal.Width           4.4
Petal.Length          6.9
Petal.Width           2.5
Species         virginica
dtype: object

In [53]:
iris

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [54]:
#show selected data points
iris.iloc[0:4,0:3]

   Sepal.Length  Sepal.Width  Petal.Length
0           5.1          3.5           1.4
1           4.9          3.0           1.4
2           4.7          3.2           1.3
3           4.6          3.1           1.5

In [57]:
#show selected data points
iris.loc[0:3,("Sepal.Length","Petal.Width")]

   Sepal.Length  Petal.Width
0           5.1          0.2
1           4.9          0.2
2           4.7          0.2
3           4.6          0.2

In [58]:
#delete selected data points
iris.drop([1,2,3],axis=0)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[147 rows x 5 columns]

In [60]:
#delete column from data frame
iris.drop('Petal.Length',axis=1)

     Sepal.Length  Sepal.Width  Petal.Width    Species
0             5.1          3.5          0.2     setosa
1             4.9          3.0          0.2     setosa
2             4.7          3.2          0.2     setosa
3             4.6          3.1          0.2     setosa
4             5.0          3.6          0.2     setosa
..            ...          ...          ...        ...
145           6.7          3.0          2.3  virginica
146           6.3          2.5          1.9  virginica
147           6.5          3.0          2.0  virginica
148           6.2          3.4          2.3  virginica
149           5.9          3.0          1.8  virginica

[150 rows x 4 columns]

In [61]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB